In [1]:
import pandas as pd

In [3]:
bike_data = pd.read_csv('bike_usage_0.csv', encoding = 'ANSI')

In [4]:
bike_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36595 entries, 0 to 36594
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date_out         36595 non-null  object
 1   Time_out         36595 non-null  int64
 2   Station_no_out   36595 non-null  int64
 3   Station_out      36595 non-null  object
 4   Membership_type  36595 non-null  object
 5   Gender           18262 non-null  object
 6   Age_Group        36595 non-null  object
 7   Momentum         36595 non-null  object
 8   Station_no_in    36595 non-null  int64
 9   Station_in       36595 non-null  object
 10  Date_in          36595 non-null  object
 11  Bike_no          36595 non-null  object
 12  Carbon_amount    36595 non-null  object
 13  Distance         36595 non-null  int64
 14  Duration         36595 non-null  int64
dtypes: int64(5), object(10)
memory usage: 4.2+ MB

In [5]:
stations = pd.read_csv('stations.csv')

In [6]:
stations

,Gu,ID,Station,Address,Latitude,Longitude,Date,No_of_Racks
0,마포구,101,101. (구)합정동 주민센터,서울특별시 마포구 동교로8길 58,37.549561,126.905754,2015-09-06 23:40,5
1,마포구,102,102. 망원역 1번출구 앞,서울특별시 마포구 월드컵로 72,37.555649,126.910629,2015-09-06 23:42,20
2,마포구,103,103. 망원역 2번출구 앞,서울특별시 마포구 월드컵로 79,37.554951,126.910835,2015-09-06 23:43,14
3,마포구,104,104. 합정역 1번출구 앞,서울특별시 마포구 양화로 59,37.550629,126.914986,2015-09-06 23:44,13
4,마포구,105,105. 합정역 5번출구 앞,서울특별시 마포구 양화로 48,37.550007,126.914825,2015-09-06 23:45,5
...,...,...,...,...,...,...,...,...
366,서초구,2510,JW타워,서초구 서초동 1748-45,37.483040,127.021461,2019.03.26,8
367,서초구,2511,이수역 6번출구 앞,서초구 방배동 438-35,37.483662,126.982323,2019.03.14,20
368,은평구,972,수색역,수색로 261,37.582180,126.894943,2019.06.14,20
369,마포구,440,하늘공원 입구,마포구 하늘공원로 108-2,37.570006,126.881149,2019.08.02,15
370,서초구,2265,2265. 이수고가차도 남단,서울특별시 서초구 동작대로 204 청남빌딩,37.494743,126.983063,2017-08-09 11:16,10

테이블 결합에서 중요한 것 : Join Type, Key  
Key : 두 테이블 간에 공통으로 존재해서 연결고리 역할을 하는 컬럼. 두 테이블의 결합 기준 정의  
하나 또는 복수의 공통 컬럼 지정 가능  
Join Type : Output 테이블에 값을 채우는 방법. 사용자가 선택한 Join Type을 기준으로 데이터가 기록됨

In [9]:
bike_data2 = pd.merge(bike_data, stations, left_on = 'Station_no_out', right_on = 'ID')

merge()함수 내부 : (왼쪽 테이블, 오른쪽 테이블, 왼쪽 테이블에서 key값으로 사용될 컬럼, 오른쪽 테이블에서 key값으로 사용될 컬럼)  
두 테이블의 key값이 일치하는 경우 양쪽 테이블의 행을 하나로 합하여 결합된 결과 테이블에 포함시킴

In [10]:
bike_data2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 36595 entries, 0 to 36594
Data columns (total 23 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date_out         36595 non-null  object
 1   Time_out         36595 non-null  int64
 2   Station_no_out   36595 non-null  int64
 3   Station_out      36595 non-null  object
 4   Membership_type  36595 non-null  object
 5   Gender           18262 non-null  object
 6   Age_Group        36595 non-null  object
 7   Momentum         36595 non-null  object
 8   Station_no_in    36595 non-null  int64
 9   Station_in       36595 non-null  object
 10  Date_in          36595 non-null  object
 11  Bike_no          36595 non-null  object
 12  Carbon_amount    36595 non-null  object
 13  Distance         36595 non-null  int64
 14  Duration         36595 non-null  int64
 15  Gu               36595 non-null  object
 16  ID               36595 non-null  int64
 17  Station          36595 non-null  object
 18  Address          36595 non-null  object
 19  Latitude         36595 non-null  float64
 20  Longitude        36595 non-null  float64
 21  Date             36595 non-null  object
 22  No_of_Racks      36595 non-null  int64
dtypes: float64(2), int64(7), object(14)
memory usage: 6.7+ MB

Join Type - How인자  
디폴트 값인 Inner 이외에도 다른 방식의 결합이 필요한 경우 사용  

inner, left, right, outer가 있음

In [11]:
df1 = pd.DataFrame({'a':['a', 'b', 'c'], 'b':[1, 2, 3]})

In [12]:
df1

   a  b
0  a  1
1  b  2
2  c  3

In [13]:
df2 = pd.DataFrame({'a':['a', 'b', 'd'], 'c':['가', '나', '다']})

In [14]:
df2

   a  c
0  a  가
1  b  나
2  d  다

In [15]:
pd.merge(df1, df2, how = 'inner', on = 'a')

   a  b  c
0  a  1  가
1  b  2  나

on : 양쪽에 동일한 key컬럼이 있을 경우 하나로 표현 가능  
left_on, right_on : key로 사용할 컬럼의 이름이 다를 때 사용

In [16]:
pd.merge(df1, df2, how = 'outer', on = 'a')

   a    b    c
0  a  1.0    가
1  b  2.0    나
2  c  3.0  NaN
3  d  NaN    다

In [17]:
pd.merge(df1, df2, how = 'left', on = 'a')

   a  b    c
0  a  1    가
1  b  2    나
2  c  3  NaN

In [18]:
pd.merge(df1, df2, how = 'right', on = 'a')

   a    b  c
0  a  1.0  가
1  b  2.0  나
2  d  NaN  다